examples/render_all_grammars/dot/tests_functional_test_import_multiple_firs.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


39619656[ label="{First|}"]

39974056[ label="{Third|+t:STRING\l}"]

40468424[ label="{ID|}"]

39597128[ label="{STRING|}"]

40358088[ label="{BOOL|}"]

39797736[ label="{INT|}"]

40355000[ label="{FLOAT|}"]

40291992[ label="{STRICTFLOAT|}"]

37553736[ label="{NUMBER|}"]

37558680[ label="{BASETYPE|}"]

40615288[ label="{*OBJECT|}"]

40220568[ label="{Second|}"]

40819832[ label="{Third|+t:INT\l}"]



39619656 -> 40220568[arrowtail=diamond, dir=both, headlabel="seconds 1..*"]
39619656 -> 39974056[arrowtail=diamond, dir=both, headlabel="thirds 1..*"]
37553736 -> 40291992 [dir=back]
37553736 -> 39797736 [dir=back]
37558680 -> 37553736 [dir=back]
37558680 -> 40355000 [dir=back]
37558680 -> 40358088 [dir=back]
37558680 -> 40468424 [dir=back]
37558680 -> 39597128 [dir=back]
40615288 -> 37558680 [dir=back]
40220568 -> 40819832[arrowtail=diamond, dir=both, headlabel="thirds 1..*"]

}
